org/2021-36.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 36 周总结
#+DATE: <2021-09-07 Tue>
近期主要计划：

[[https://github.com/tianheg/blog/issues/142]]

本周目标：

- :heavy_check_mark: 读完《图解HTTP》（读完第一章）
- 学习数组链表（极客时间）
- 个人知识体系第n+1阶段（真善美）
- 温习 CSS，JS 基础知识

周一：

- [X] Memrise 英语单词
- [X] 正常使用 MySQL 数据库

周二：

- [X] Memrise 英语单词
- [X] 整理TIL
- [X] 图解HTTP
- [X] 剑指Offer

周三：

- [X] 三傻大闹宝莱坞
- [X] pacman 尝试安装 gitlab(注意要在vagrant实验环境中操作！)
- [X] 图解HTTP
- [X] 剑指Offer

周四：

- [X] 阅读《图解HTTP》并记笔记
- [X] 用树莓派听歌 cmus

周五：

- [X] 用 Vue 重写 tris 站点
- [X] 找一个好用的 graphical database management tool， like navicat

这一周是大四开学的第 2
周，是开始阅读《图解HTTP》的第一周，是和父母矛盾到达一个新阶段的时期。

时间从指缝间流逝，我在努力利用时间，让自己的生活更加美好。
