blog/2021/2021-36.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 17:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 36 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 36 周总结</h1>
</header><p>
近期主要计划：
</p>

<p>
<a href="https://github.com/tianheg/blog/issues/142">https://github.com/tianheg/blog/issues/142</a>
</p>

<p>
本周目标：
</p>

<ul class="org-ul">
<li>:heavy_check_mark: 读完《图解 HTTP》（读完第一章）</li>
<li>学习数组链表（极客时间）</li>
<li>个人知识体系第 n+1 阶段（真善美）</li>
<li>温习 CSS，JS 基础知识</li>
</ul>

<p>
周一：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Memrise 英语单词</li>
<li class="on"><code>[X]</code> 正常使用 MySQL 数据库</li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Memrise 英语单词</li>
<li class="on"><code>[X]</code> 整理 TIL</li>
<li class="on"><code>[X]</code> 图解 HTTP</li>
<li class="on"><code>[X]</code> 剑指 Offer</li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 三傻大闹宝莱坞</li>
<li class="on"><code>[X]</code> pacman 尝试安装 gitlab(注意要在 vagrant 实验环境中操作！)</li>
<li class="on"><code>[X]</code> 图解 HTTP</li>
<li class="on"><code>[X]</code> 剑指 Offer</li>
</ul>

<p>
周四：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 阅读《图解 HTTP》并记笔记</li>
<li class="on"><code>[X]</code> 用树莓派听歌 cmus</li>
</ul>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 用 Vue 重写 tris 站点</li>
<li class="on"><code>[X]</code> 找一个好用的 graphical database management tool，like navicat</li>
</ul>

<p>
这一周是大四开学的第 2
周，是开始阅读《图解 HTTP》的第一周，是和父母矛盾到达一个新阶段的时期。
</p>

<p>
时间从指缝间流逝，我在努力利用时间，让自己的生活更加美好。
</p>
</div>
</body>
</html>